app/Controllers/Login.php

SELECT *
FROM `m_login`
WHERE `email` = 'raihanmalikul0@gmail.com'
---
    public function actionLogin()
    {
        $email    = $this->request->getVar('email');
        $pass     = md5($this->request->getVar('pass'));

        $getData  = $this->Login->getWhere(['email' => $email])->getRowArray();