app/Controllers/LoginAdmin.php

    public function actionLogin()
    {
        $username = $this->request->getVar('username');
        $password = md5($this->request->getVar('password'));
        $data     = $this->LoginAdmin->where('username', $username)->first();
        if ($data) {
            $user_valid = $data['user_valid'];
            if ($user_valid == 1) {
                $pass = $data['password'];
                if($password == $pass){
                    $id = $data['id'];
                    $dt = ['status_login' => '1'];
                    $this->db->table('login_admin')->update($dt, array('id' => $id));
---
SELECT *
FROM `m_login_admin`
WHERE `username` = 'darth@theempire.com'
 LIMIT 1
UPDATE `m_login_admin` SET `status_login` = '1', `updated_at` = '2022-07-29 05:36:51'
WHERE `id` = '1'