app/Controllers/Proses.php

    private function _getMsProduct($slug = "")
    {
        $result = $this->msProduct
            ->where('slug', $slug)
            ->orderby('product_id', 'ASC')
            ->get();
---
SELECT *
FROM `m_product`
WHERE `slug` = 'thobe-premium-01'
ORDER BY `product_id` ASC